Revit 2027 API
GenericForm.IsSolid Property
Identifies if the GenericForm is a solid or a void element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsSolid { get; }
Public ReadOnly Property IsSolid As Boolean
	Get
public:
property bool IsSolid {
	bool get ();
}
member IsSolid : bool with get
Property Value
Boolean
True if the form is a solid, false if the solid is a void element.
See Also
Reference
GenericForm Class
Autodesk.Revit.DB Namespace